saas_cardservice/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "IZc3fx8MiwYccQs3kPHrqw=="], ["LIMIT", 1]]
---
  def set_current_user
    @current_user ||= session[:session_token ] && User.find_by_session_token(session[:session_token])