saas_cardservice/app/controllers/piles_controller.rb

SELECT "piles".* FROM "piles"
---
  def index
    @piles = Pile.all

SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Deck2"], ["LIMIT", 1]]
UPDATE "piles" SET "visible" = ?, "updated_at" = ? WHERE "piles"."id" = ?  [["visible", 1], ["updated_at", "2020-12-12 20:16:55.814140"], ["id", 2]]
---
  def change_visibility
    @form_token = form_authenticity_token
      pile_hash = params[:pile]
      pile = Pile.find_by(Name: pile_hash[:visible])
      pile.update_attribute(:visible, !pile[:visible])

SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Main Deck"], ["LIMIT", 1]]
SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Deck2"], ["LIMIT", 1]]
---
  def move_card
    @form_token = form_authenticity_token
    pile_hash = params[:pile]
    pile = Pile.find_by(Name: pile_hash[:deck_from])
    pile.move_card(Pile.find_by(Name: pile_hash[:deck_to]).id)

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ? LIMIT ?  [["pile_type", "hand"], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ? AND "cards"."image" = ? LIMIT ?  [["pile_id", 5], ["image", "KC.png"], ["LIMIT", 1]]
UPDATE "cards" SET "image" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["image", "Main Sink"], ["updated_at", "2020-12-12 19:50:38.334444"], ["id", 51]]
SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Main Sink"], ["LIMIT", 1]]
---
  def move_card_from_hand
    @form_token = form_authenticity_token
    pile_hash = params[:pile]
    pile_from = Pile.find_by(pile_type: 'hand')
    card = Card.where(pile_id: pile_from.id).find_by(image: pile_hash[:card_selected])
    card.update_attribute(:pile_id, Pile.find_by(Name: pile_hash[:pile_to]).id)

SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Main Deck"], ["LIMIT", 1]]
---
  def shuffle
    @form_token = form_authenticity_token
    pile_hash = params[:pile]
    pile = Pile.find_by(Name: pile_hash[:shuffle_pile])

SELECT "piles".* FROM "piles" WHERE "piles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_pile
    @pile = Pile.find(params[:id])