saas_cardservice/app/controllers/piles_controller.rb

SELECT "piles".* FROM "piles" WHERE "piles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_pile
      @pile = Pile.find(params[:id])