saas_cardservice/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by user_id: session_params[:user_id], email: session_params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? AND "users"."email" = ? LIMIT ?  [["user_id", ""], ["email", ""], ["LIMIT", 1]]