saas_cardservice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "bullshit"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by user_id: user_params[:user_id]

INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "bullshit"], ["email", "bullshit"], ["session_token", "IZc3fx8MiwYccQs3kPHrqw=="], ["created_at", "2020-12-08 20:50:37.264192"], ["updated_at", "2020-12-08 20:50:37.264192"]]
---
  def create_user!(user_params)
    user_params[:session_token] = SecureRandom.base64
    @user = User.create!(user_params)