saas_cardservice/app/views/home/home.html.erb

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "sink"]]
---
    <div class="piles">
      <% sinks = Pile.where(pile_type: 'sink') %>