saas_cardservice/app/views/home/home.html.erb

      <div class="piles">
        <% all_decks = Pile.where(pile_type: 'deck') %>
        <% Pile.where(pile_type: 'deck').each do |deck| %>
          <% if deck.visible && !deck.cards.first.nil?%>
            <div class="pile" style="background-image: url(<%= image_url(deck.cards.first.image) %>); background-repeat: no-repeat;" >
---
SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "deck"]]
SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" != ?  [["pile_type", "hand"]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ? ORDER BY "cards"."id" ASC LIMIT ?  [["pile_id", 5], ["LIMIT", 1]]
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

      <div class="piles">
        <% Pile.where(pile_type: 'sink').each do |sink| %>
          <% if sink.visible && !sink.cards.first.nil?%>
            <div class="pile" style="background-image: url(<%= image_url(sink.cards.first.image) %>); background-repeat: no-repeat;" >
---
SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "sink"]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ? ORDER BY "cards"."id" ASC LIMIT ?  [["pile_id", 4], ["LIMIT", 1]]
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"

      <div class="piles">
        <% Pile.where(pile_type: 'hand').each do |hand| %>
---
SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "hand"]]

                      <ul class="dropdown-menu">
                        <% Pile.all.each do |pile| %>
---
SELECT "piles".* FROM "piles"