saas_cardservice/app/views/home/home.html.erb

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ? LIMIT ?  [["pile_type", "hand"], ["LIMIT", 1]]
---
    <%= label :pile, :card_selected, 'Move card ' %>
    <%= select :pile, :card_selected, Pile.find_by(pile_type: 'hand').cards.collect { |card| [card.image] } %>

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" != ?  [["pile_type", "hand"]]
---
    <%= label :pile, :shuffle_pile, 'Pile to Shuffle ' %>
    <%= select :pile, :shuffle_pile, Pile.all.where.not(pile_type: 'hand').collect { |pile| [pile.Name] } %>

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "deck"]]
---
  <div class="piles">
    <% Pile.where(pile_type: 'deck').each do |deck| %>

SELECT MAX("cards"."position") FROM "cards" WHERE "cards"."pile_id" = ?  [["pile_id", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ? ORDER BY position DESC LIMIT ?  [["pile_id", 1], ["LIMIT", 1]]
---
      <% elsif deck.visible && !deck.cards.first.nil? %>
        <div class="pile" style="background-image: url(<%= image_url(deck.cards.order("position DESC").first.image) %>); background-repeat: no-repeat;">

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "sink"]]
---
  <div class="piles">
    <% Pile.where(pile_type: 'sink').each do |sink| %>

SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ? ORDER BY position DESC LIMIT ?  [["pile_id", 3], ["LIMIT", 1]]
---
      <% elsif sink.visible %>
        <div class="pile" style="background-image: url(<%= image_url(sink.cards.order("position DESC").first.image) %>); background-repeat: no-repeat;">

SELECT "piles".* FROM "piles" WHERE "piles"."pile_type" = ?  [["pile_type", "hand"]]
---
  <div class="piles">
    <% Pile.where(pile_type: 'hand').each do |hand| %>