saas_cardservice/app/models/card.rb

class Card < ApplicationRecord
  belongs_to :pile

  # Creating Card method that will create a card with a suit, value, and pile it belongs to.
  def self.create_card!(i)
    possibleSuits = ["Diamonds","Spades","Hearts","Clubs"]
    possibleValues = ["Ace","Two","Three","Four","Five","Six","Seven","Eight","Nine","Ten","Jack","Queen","King"]
    isSuit = false
    isValue = false
    isSuit = true if possibleSuits.include? i[:suit]
    isValue = true if possibleValues.include? i[:value]
    if isValue and isSuit
      cards = Card.where(pile_id: i[:pile].id)
      i[:position] = cards.length
---
INSERT INTO "cards" ("suit", "value", "position", "created_at", "updated_at", "pile_id") VALUES (?, ?, ?, ?, ?, ?)  [["suit", "Diamonds"], ["value", "Ace"], ["position", 0.0], ["created_at", "2020-12-05 05:40:59.959796"], ["updated_at", "2020-12-05 05:40:59.959796"], ["pile_id", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ?  [["pile_id", 1]]

          i[:image] = '6C.png'
        end
      end
      Card.create!(i)
---
INSERT INTO "cards" ("suit", "value", "position", "created_at", "updated_at", "pile_id") VALUES (?, ?, ?, ?, ?, ?)  [["suit", "Diamonds"], ["value", "Ace"], ["position", 0.0], ["created_at", "2020-12-05 17:18:45.905455"], ["updated_at", "2020-12-05 17:18:45.905455"], ["pile_id", 2]]