saas_cardservice/app/models/pile.rb

  def self.create_pile!(params)
    @pile = Pile.find_by Name: params[:Name]
---
SELECT "piles".* FROM "piles" WHERE "piles"."Name" = ? LIMIT ?  [["Name", "Main Deck"], ["LIMIT", 1]]

  def self.create_deck!(params)
    possible_suits = %w[D S H C]
    possible_values = %w[A 2 3 4 5 6 7 8 9 10 J Q K]
    deck = Pile.create!({ Name: params[:Name], pile_type: 'deck', visible: false })
    possible_values.each do |value|
      possible_suits.each do |suit|
        Card.create_card!({ value: value, suit: suit, pile: deck })
      end
    end
  end

  # Creating Sink method that will create a pile named 'Sink.' This will contain no cards until cards are added.
  def self.create_sink!(params)
    Pile.create!({ Name: params[:Name], pile_type: 'sink', visible: false })
---
INSERT INTO "piles" ("Name", "pile_type", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "Main Deck"], ["pile_type", "deck"], ["visible", 0], ["created_at", "2020-12-05 05:40:59.933180"], ["updated_at", "2020-12-05 05:40:59.933180"]]
INSERT INTO "piles" ("Name", "pile_type", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "Sink2"], ["pile_type", "sink"], ["visible", 0], ["created_at", "2020-11-17 06:37:35.820943"], ["updated_at", "2020-11-17 06:37:35.820943"]]
INSERT INTO "piles" ("Name", "pile_type", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "Main Sink"], ["pile_type", "sink"], ["visible", 0], ["created_at", "2020-12-05 05:41:00.324648"], ["updated_at", "2020-12-05 05:41:00.324648"]]

  def self.create_hand!(params)
    Pile.create!({ Name: params[:Name], pile_type: 'hand', visible: false })
---
INSERT INTO "piles" ("Name", "pile_type", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "Player Hand"], ["pile_type", "hand"], ["visible", 0], ["created_at", "2020-12-12 19:23:17.970764"], ["updated_at", "2020-12-12 19:23:17.970764"]]

  def move_card(new_pile_id)
    card = cards.last
    card.update_attribute(:pile_id, new_pile_id)
    pile_length = Pile.find(new_pile_id).cards.length-1
    card.update_attribute(:position, pile_length)
---
UPDATE "cards" SET "pile_id" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["pile_id", nil], ["updated_at", "2020-12-12 04:14:48.009221"], ["id", 3]]
SELECT "cards".* FROM "cards" WHERE "cards"."pile_id" = ?  [["pile_id", 6]]
SELECT "piles".* FROM "piles" WHERE "piles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "cards" SET "position" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["position", 1.0], ["updated_at", "2020-12-12 18:49:50.767856"], ["id", 52]]

  def shuffle_pile
    list_of_cards = cards.to_a
    index = 0
    until list_of_cards.empty?
      current = list_of_cards.delete(list_of_cards.sample)
      card_to_update = Card.find(current.id)
      card_to_update.update_attribute(:position, index)
---
SELECT "piles".* FROM "piles" WHERE "piles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "piles" SET "visible" = ?, "updated_at" = ? WHERE "piles"."id" = ?  [["visible", 1], ["updated_at", "2020-12-10 21:18:10.177032"], ["id", 1]]
UPDATE "cards" SET "position" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["position", 1.0], ["updated_at", "2020-12-12 20:15:00.493333"], ["id", 19]]